[
    {
        "id": "chicken-parmesan",
        "title": "Chicken Parmesan",
        "description": "This optimized chicken Parmesan recipe features a crispy crust, less sauce, and the perfect blend of mozzarella and Parmesan cheese.",
        "prepTime": "15 minutes",
        "cookTime": "20 minutes",
        "servings": "4",
        "ingredients": [
            "1/4 cup olive oil",
            "1 yellow onion, finely chopped",
            "3 cloves garlic, minced",
            "1 (28 oz) can crushed tomatoes",
            "10 fresh basil leaves",
            "1 cup panko breadcrumbs",
            "1/2 cup grated Parmesan cheese",
            "4 boneless, skinless chicken breasts, pounded to 1/4-inch thickness",
            "2 large eggs, beaten",
            "2 cups shredded mozzarella cheese"
        ],
        "instructions": [
            "In a large skillet, heat 1/4 cup olive oil over medium heat. Add the chopped onion and minced garlic and cook until softened and fragrant, about 5 minutes.",
            "Add the crushed tomatoes and fresh basil leaves to the skillet. Simmer the sauce for 10 minutes, stirring occasionally, until thickened.",
            "In a shallow bowl, mix together the panko breadcrumbs and 1/2 cup grated Parmesan cheese.",
            "Dip the pounded chicken breasts in the beaten eggs, then dredge them in the panko-Parmesan mixture, pressing to help the crumbs adhere.",
            "In a large skillet, heat 1/4 inch of vegetable oil over medium-high heat. Fry the breaded chicken in batches for 2-3 minutes per side, until golden brown and crispy.",
            "Preheat the oven to 400°F. Place the fried chicken in a baking dish and top each piece with some of the prepared tomato sauce and shredded mozzarella cheese.",
            "Bake for 10-12 minutes, until the cheese is melted and bubbly.",
            "Serve the chicken Parmesan hot, garnished with additional fresh basil if desired."
        ],
        "variations": [
            "Add a sprinkle of Italian seasoning or red pepper flakes to the panko-Parmesan coating for extra flavor.",
            "Substitute fresh mozzarella slices for the shredded mozzarella cheese.",
            "Serve the chicken Parmesan over a bed of spaghetti or linguine."
        ],
        "troubleshooting": [
            "Q: Why is my chicken Parmesan soggy? A: Make sure to fully fry the chicken until it's crispy before baking, and use just enough sauce to cover the top rather than drowning the chicken.",
            "Q: How do I keep the breading from falling off? A: Ensure the chicken is thoroughly coated in the egg wash and panko-Parmesan mixture, and press the breading firmly onto the chicken before frying."
        ],
        "image": "/images/chicken-parmesan.png"
    },
    {
        "id": "lasagna",
        "title": "Lasagna",
        "description": "This classic lasagna recipe is made with an easy meat sauce as the base. Layer the sauce with noodles and cheese, then bake until bubbly! This is great for feeding a big family and freezes well, too.",
        "prepTime": "1 hour",
        "cookTime": "50 minutes + standing",
        "servings": "12",
        "ingredients": [
            "1 1/2 pounds lean ground beef",
            "1 pound bulk Italian sausage",
            "1 (8 ounce) package fresh mushrooms, coarsely chopped",
            "1 teaspoon salt",
            "1/2 teaspoon freshly ground black pepper",
            "1/2 teaspoon Italian seasoning (optional)",
            "1/4 teaspoon red pepper flakes",
            "6 cups prepared marinara sauce",
            "1/4 cup water, or as needed (optional)",
            "1 (16 ounce) package lasagna noodles",
            "2 large eggs",
            "2 pounds whole-milk ricotta cheese",
            "8 ounces fresh mozzarella cheese, diced",
            "2/3 cup freshly grated Parmigiano-Reggiano cheese",
            "1/4 cup chopped fresh parsley",
            "1 teaspoon salt"
        ],
        "instructions": [
            "Start by making the sauce with ground beef, bell peppers, onions, and a combo of tomato sauce, tomato paste, and crushed tomatoes.",
            "Let this simmer while you boil the noodles and get the cheeses ready.",
            "We're using ricotta, shredded mozzarella, and parmesan—like the mix of tomatoes, this 3-cheese blend gives the lasagna great flavor!",
            "From there, it's just an assembly job. A cup of meat sauce, a layer of noodles, more sauce, followed by a layer of cheese. Repeat until you have three layers and have used up all the ingredients.",
            "Bake until bubbly and you're ready to eat!"
        ],
        "variations": [
            "Use all beef or all sausage instead of a combination",
            "Try ground chicken or ground turkey instead of beef/sausage",
            "Make a vegetable lasagna as a meatless variation",
            "Reduce the cheese by skipping the mozzarella inside the layers and just sprinkling it on top"
        ],
        "troubleshooting": [
            "Q: Why is my lasagna watery? A: Make sure to let the lasagna rest for 20 minutes before slicing, which helps the cheese and sauce set up.",
            "Q: My noodles are stuck together! A: Be sure to boil the noodles until just tender, not fully cooked. Also, toss the cooked noodles with a bit of olive oil to prevent sticking."
        ],
        "image": "/images/lasagna.png"
    },
    {
        "id": "meatloaf",
        "title": "Meatloaf",
        "description": "A simple, classic homemade meatloaf recipe that's comfort food at its best, as shared by comedian Carol Burnett.",
        "prepTime": "15 minutes",
        "cookTime": "50 minutes",
        "servings": "7 slices",
        "ingredients": [
            "1.5 lbs ground beef (80/20 blend)",
            "2 eggs",
            "1/2 cup milk",
            "1 (15 oz) can tomato sauce",
            "1 onion, finely diced",
            "1/2 green bell pepper, finely diced",
            "1 cup breadcrumbs",
            "1 tsp garlic salt",
            "1 tsp onion salt"
        ],
        "instructions": [
            "Preheat oven to 350°F.",
            "In a large bowl, combine the ground beef, eggs, milk, 1/2 cup of the tomato sauce, onion, bell pepper, breadcrumbs, garlic salt, and onion salt. Mix until well incorporated.",
            "Transfer the meatloaf mixture to a baking sheet or loaf pan and shape into a loaf.",
            "Bake for 50 minutes.",
            "Remove from oven and spread the remaining tomato sauce over the top of the meatloaf.",
            "Return to oven and bake for an additional 10 minutes.",
            "Let rest for 5-10 minutes before slicing and serving."
        ],
        "variations": [
            "Add grated cheddar cheese to the meatloaf mixture",
            "Mix in sautéed mushrooms or spinach",
            "Top with bacon or crispy onions"
        ],
        "troubleshooting": [
            "Q: Why is my meatloaf dry or crumbly? A: Make sure not to overmix the ingredients and use the proper ratio of breadcrumbs to prevent the meatloaf from becoming too dense.",
            "Q: My meatloaf is falling apart when I slice it. A: Ensure you are using a finer ground beef and mincing the onions very finely to help bind the loaf together.",
            "Q: The glaze is too sweet/tangy. A: Adjust the ratio of ketchup, brown sugar, and Worcestershire sauce to your taste preferences."
        ],
        "image": "/images/meatloaf.png"
    },
    {
        "id": "chili",
        "title": "Chili",
        "description": "This hearty beef chili simmers low and slow so the onions, peppers, and tomatoes meld until creamy. The recipe yields sixteen cups—perfect for feeding a crowd or freezing extra for later.",
        "prepTime": "10 minutes",
        "cookTime": "1 hour 30 minutes",
        "servings": "16",
        "ingredients": [
            "1 pound ground beef",
            "1 onion, chopped",
            "3 cloves garlic, minced",
            "2 tablespoons tomato paste",
            "2 tablespoons chili powder",
            "1 tablespoon ground cumin",
            "1 teaspoon dried oregano",
            "1 teaspoon paprika",
            "1 teaspoon salt",
            "1/4 teaspoon chipotle chili powder (or more, to taste)",
            "1 (28 ounce) can crushed tomatoes",
            "1 (15 ounce) can kidney beans, drained and rinsed"
        ],
        "instructions": [
            "Cook the ground beef in a large pot over medium-high heat until browned and crumbled, 5 to 7 minutes. Drain excess fat.",
            "Add the onion and cook until soft and translucent, about 5 minutes.",
            "Add the garlic and cook for 1 minute, until fragrant.",
            "Stir in the tomato paste and cook for 2 to 3 minutes, until it starts to darken and stick to the pot.",
            "Add the chili powder, cumin, oregano, paprika, salt, and chipotle chili powder. Stir to coat the beef.",
            "Pour in the crushed tomatoes and kidney beans. Bring to a simmer.",
            "Reduce heat to medium-low and let the chili simmer, stirring occasionally, for 45 minutes to 1 1/2 hours, until thickened and flavors have melded.",
            "Taste and adjust seasonings as needed."
        ],
        "variations": [
            "Use black, pinto, or mixed beans instead of kidney beans.",
            "Add diced zucchini, squash, carrots, or celery.",
            "Swap the ground beef for ground turkey, pork, or a mix.",
            "Increase the chipotle chili powder for more heat."
        ],
        "troubleshooting": [
            "Q: Why is my chili watery? A: Let it simmer longer to allow the flavors to meld and the liquid to reduce.",
            "Q: My chili is too spicy. A: Reduce the amount of chipotle chili powder next time.",
            "Q: How can I make my chili thicker? A: Let it simmer longer or add a cornstarch slurry to thicken it."
        ],
        "tags": [
            "main-course",
            "american",
            "comfort-food",
            "soup"
        ],
        "image": "/images/chili.png"
    },
    {
        "id": "chicken-alfredo--fettuccine-alfredo",
        "title": "Chicken Alfredo / Fettuccine Alfredo",
        "description": "A rich and creamy homemade Alfredo sauce served with tender chicken and fettuccine pasta. This recipe is easy enough for beginner cooks, yet impressive enough for company.",
        "prepTime": "15 minutes",
        "cookTime": "15 minutes",
        "servings": "6",
        "ingredients": [
            "12 ounces fettuccine pasta",
            "1 cup unsalted butter",
            "1 cup heavy cream",
            "1 teaspoon salt",
            "1/2 teaspoon ground black pepper",
            "1/2 teaspoon garlic salt",
            "1 cup grated Romano cheese",
            "1 cup grated Parmesan cheese"
        ],
        "instructions": [
            "Bring a large pot of salted water to a boil. Add the fettuccine and cook according to package instructions until al dente.",
            "In a large saucepan, melt the butter over medium heat. Whisk in the heavy cream, salt, black pepper, and garlic salt. Simmer for 2-3 minutes, stirring frequently, until the sauce thickens slightly.",
            "Remove the saucepan from heat and stir in the grated Romano and Parmesan cheeses until smooth and creamy.",
            "Drain the cooked fettuccine and add it to the Alfredo sauce. Toss to coat the pasta evenly.",
            "Serve the Fettuccine Alfredo immediately."
        ],
        "variations": [
            "Add cooked, sliced chicken breast",
            "Mix in sautéed shrimp or Italian sausage",
            "Top with fresh chopped parsley or basil",
            "Serve with a side salad or roasted vegetables"
        ],
        "troubleshooting": [
            "Q: Why is my Alfredo sauce too thin?",
            "A: The sauce may need to simmer a bit longer to thicken up. Alternatively, you can add a tablespoon or two of cornstarch or flour to help thicken it.",
            "Q: Why is my Alfredo sauce grainy?",
            "A: This can happen if the cheese is added too quickly or at too high of a heat. Be sure to add the cheese slowly and over low heat, stirring constantly until it's fully melted and incorporated."
        ],
        "tags": [
            "main-course",
            "italian"
        ],
        "image": "/images/chicken-alfredo--fettuccine-alfredo.png"
    },
    {
        "id": "spaghetti--meatballs",
        "title": "Spaghetti & Meatballs",
        "description": "This recipe for spaghetti and meatballs delivers a hearty tomato sauce and tender, flavorful meatballs. It's the ultimate comfort food classic.",
        "prepTime": "45 minutes",
        "cookTime": "2 hours 30 minutes",
        "servings": "4-6",
        "ingredients": [
            "1 pound ground beef",
            "1/2 pound ground pork",
            "1/2 pound ground veal",
            "1 cup day-old bread, torn into small pieces",
            "1 cup whole milk",
            "1/2 cup grated Parmesan",
            "2 eggs, beaten",
            "3 garlic cloves, minced",
            "2 teaspoons dried oregano",
            "1 teaspoon red pepper flakes",
            "1 teaspoon kosher salt",
            "1/2 teaspoon freshly ground black pepper",
            "3 tablespoons olive oil",
            "1 onion, diced",
            "4 garlic cloves, minced",
            "1/4 cup tomato paste",
            "1 (28-ounce) can crushed tomatoes",
            "1 (28-ounce) can whole peeled tomatoes, crushed by hand",
            "2 bay leaves",
            "1 teaspoon dried oregano",
            "1/2 teaspoon red pepper flakes",
            "1/4 cup roughly chopped fresh basil",
            "1 pound spaghetti"
        ],
        "instructions": [
            "Make the meatballs: In a large bowl, combine the beef, pork, veal, bread, milk, Parmesan, eggs, garlic, oregano, red pepper flakes, salt, and pepper. Mix gently with your hands until just combined. Do not overmix.",
            "Using a 1/4-cup measure, scoop the meatball mixture and roll into balls. Place on a rimmed baking sheet.",
            "Make the sauce: In a large pot, heat the olive oil over medium heat. Add the onion and cook, stirring occasionally, until softened, about 5 minutes. Add the garlic and cook until fragrant, about 1 minute.",
            "Add the tomato paste and cook, stirring frequently, until darkened in color, about 2 minutes.",
            "Add the crushed tomatoes, whole peeled tomatoes, bay leaves, oregano, and red pepper flakes. Bring to a simmer and cook, stirring occasionally, until thickened, about 2 hours.",
            "Add the meatballs to the sauce and continue to simmer until the meatballs are cooked through, about 30 minutes.",
            "Remove the bay leaves. Stir in the basil.",
            "Bring a large pot of salted water to a boil. Cook the spaghetti according to package instructions until al dente. Drain and toss with the sauce and meatballs."
        ],
        "variations": [
            "Use all beef or substitute Italian sausage for the pork and/or veal",
            "Add additional herbs like parsley or thyme",
            "Serve the meatballs and sauce over other types of pasta, such as linguine or rigatoni"
        ],
        "troubleshooting": [
            "Q: Why are my meatballs tough or dry?",
            "A: Avoid overmixing the meatball mixture, which can make the texture tough. Also, be careful not to overcook the meatballs.",
            "Q: My sauce is too thin or watery.",
            "A: Simmer the sauce longer to allow it to thicken. You can also add a bit of tomato paste to help reduce the moisture."
        ],
        "tags": [
            "main-course",
            "italian"
        ],
        "image": "/images/spaghetti--meatballs.png"
    }
]